create_clock -period 16 tx_slowclk
create_clock -period 16 rx_slowclk
#set_output_delay -clock pll_50 5 [ all_outputs ]
#set_input_delay -clock pll_50 5 [ all_inputs ]

